{
    "version": "0.1",
    "pageContent": 
	{
        "_comments": "object that contains data for page labels, buttons, etc.",
        "navItems": 
		{
            "_common": 
			{
                "buttonBackToGallery": 
				{
                    "name": "Back To Gallery",
					"method": "backToGallery()",
					"idName": "backToGallery"	
                },
                "buttonStartTutorial": 
				{
                    "name": "Start Tutorial",
					"method": "startTutorialFromDetailsScreen()",
					"idName": "startTutorial"
                },
				"buttonViewDetails": 
				{
                    "name": "View Details",
					"method": "viewDetails()",
					"idName": "stepsViewDetails"	
                }
            }
        }
    },
    "tutorial": 
	{
        "_common": 
		{
            "name": "Optimizing the startup time of an independent Integration Server",
            "shortDescription": "Learn how to optimize the startup time of an independent integration server using the ibmint commandFileExists node to trigger a message flow (requires v12.0.4.0 or higher)",
            "durationText": "This tutorial takes approximately",
            "durationTime": "10 minutes",
            "_resourceToOpenComment": "The ID of the first resource to open when the user imports the tutorial. Resource IDs are defined in the repo_metadata.json Tutorials listing on ot4i.",
            "resourceToOpen": "MainFlow",
            "helpLink": 
			{
                "text": "IBM Documentation",
           		"link": "https://www.ibm.com/docs/SSTTDS_12.0/com.ibm.etools.mft.doc/acesw_home.html"
            }
        },
        "pageDetails": 
		{
            "topicsName": "Tutorial topics",
            "_topicListComment": "A short list of product concepts or tasks demonstrated by this tutorial",
            "topicList": 
			[
                {
                    "title": "Command: ibmint optimize server"
                }
            ],
            "outcomesName": "Learning outcomes",
            "_outcomesComment": "A description of what the user will have learned or accomplished by running this tutorial.",
            "outcomeList": 
			[
                {
                    "title": "Speed up the start time for an independent integration server running in a container, by determining functions of the server which are not required using the ibmint optimize command."
                }
            ],

			
			            "summary": 
			{
                "overviewName": "OVERVIEW",
                "_overviewComment": "This tutorial demonstrates how to implement a shared variable in-memory cache in a message flow. It shows using a Compute node to replace an abbreviated value in a message with an associated full name from a Lookup table that is cached in memory. Another Compute node shows how to load the Lookup table based upon CSV content stored in a local file.",
                "sections": 
				[
                    {
                        "section": "This tutorial demonstrates how the ibmint command can be used to optimize the startup time for an independent integration server. The purpose of optimization is to speed up server startup in cloud container environments. The techniques discussed only apply to independent integration servers and are not suitable for integration servers that are managed by an integration node. Server optimization is suitable when the server content is fixed and it is desireable to reduce the startup time of the process to be as short as possible. The tutorial provides a simple example message flow which will be deployed and tested using a local independent integration server created in the Toolkit. The tutorial then switches to a Command Console where several ibmint commands server will be used to demonstrate the process of optimizing startup. The tutorial deliberately breaks down the optimization task into several separate stages, in order to better identify and explain some of the most frequently used options. The first optimization stage demonstrates how the server itself can decide which components are unnecessary (based upon the server's configuration and deployed content). The second optimization stage goes a step further and demonstrates the impact of not starting a JVM within the server process. The third and final optimization stage turns off the server's use of NodeJS."
					}
                ]
            },			
			"helpLinks": 
			{
				"_helpLinksComment": "Helplinks that have a type:web attribute are rendered as web links. Otherwise, links are assumed to be to embedded Help topics in the Knowledge Center.",
				"title": "Find out more",
				"details": 
				[
					{
						"title": "IBM Documentation link to ",
						"description": "Optimizing the startup time for an independent integration server",
                        "link": "https://www.ibm.com/docs/en/app-connect/12.0?topic=solutions-optimizing-startup-time-independent-integration-server",
						"type": "web"
					}
				]
			}
        },
        "pageSteps": 
		{
            "create": 
			{
                "overview": 
				{
                    "name": "Create",
                    "heading": "Import projects",
                    "_createComment": "A description of what will happen when the user clicks Import.",
                    "sections": 
					[
                        {
                            "section": "When you click Import, one project will be created in your workspace: An application named <span class='application'>ExampleApplication</span>"
                        },
                        {
                            "section": "<span class='application'>ExampleApplication</span> provides a single message flow named <span class='application'>ExampleFlow</span> which us driven by an HTTP input, converts a JSON format message into an XML format message using a Compute node, and sends the data back to the requesting HTTP client. The main purpose of the tutorial is not centered around the development or function of the flow, but rather the process of optimizing an independent integration server which has had the message flow deployed."							
                        },
						{ 
                        	"section":"<span class='uicontrol'>HTTP Input</span>: An Input node that receives an input message across HTTP in JSON format."
                        },
                        { 
                        	"section":"<span class='uicontrol'>Compute</span>: A Compute node that converts the JSON data into the XMLNSC domain, and reformats the data fields to be uppercase."
                        },
						{ 
                        	"section":"<span class='uicontrol'>HTTP Reply</span>: A Reply node that returns the XML message across HTTP."
                        },
                        {
			    			"section": "Once imported using the link on the right, the provided project is ready to be deployed and testedusing the Toolkit's built-in Flow Exerciser. Once tested, the server will be optimized and we will observe the impact on the process startup time."
						}
                    ]
                },
                "helpLinks": 
				{
                    "title": "Find out more",
                    "details": 
					[
                        {
                            "title": "IBM Documentation link to ",
                            "description": "Developing integration solutions from scratch",
                            "link": "https://www.ibm.com/docs/SSTTDS_12.0/com.ibm.etools.mft.doc/bi12002_.htm",
							"type": "web"
                        },
						{
						"title": "IBM Documentation link to ",
						"description": "Optimizing the startup time for an independent integration server",
                        "link": "https://www.ibm.com/docs/en/app-connect/12.0?topic=solutions-optimizing-startup-time-independent-integration-server",
						"type": "web"
						}                        
                    ]
                },
                "actions": 
				{
                    "title": "Create Actions",
                    "details": 
					[
                        {
                            "name": "Import",
                            "method": "importArtifacts()"
                        }
                    ]
                }
            },
            "prepare": 
			{
                "overview": 
				{
                    "name": "Prepare",
                    "heading": "The following steps help you to prepare your environment ready for running the message flow.",
                    "_prepareComment": "A description of what just happened when the user clicked Import, and what will happen when the user clicks Deploy.",
                    "sections": [
				    {
                       "section":"<b>Create an Integration Server</b>",
						  "steps":
                        {
                          "type": "ordered",
                          "details":
                          [
                            {
                                "details": "From the Integration Explorer view in the bottom left corner of the Toolkit, right-click the Integration Servers folder and select the option to <span class='uicontrol'>Create a local integration server</span>. Leave all the options with their default values."
                            },
							{
                            "details": "<b>It is important to select the default options for this wizard</b>, because when the server is created it will include the assignment of a JVM Debug Port. Later on, when we execute the first stage of server optimization, this will cause the ibmint command to require the JVM to remain a switched on part of the server's behaviour. In sunsequent optimization steps we will then switch this off, as the message flow we are using does not actually require Java.  Click Finish on the dialog and the local Integration Server will be started, using a project in your Toolkit's workspace as the work directory. Click OK to dismiss the Success dialog."
                    		},	
							{
                            "details": "Next you will use the Flow exerciser to send HTTP requests to the message flow."
                    		}		
						  ]
						}
					}
             ]
                },
                "helpLinks": 
				{
                }
            },
            "run": 
			{
                "overview": 
				{
                    "name": "Run",
                    "heading": "",
                    "_runComment": "The full steps for the user to run through the tutorial. Use 'sections' to render paragraphs, 'steps' with a type of 'ordered' or 'unordered' to render HTML lists, and 'substeps' to render nested lists.",
                "sections":[                            
                            {
                                "section": "<h4>Use the Flow Exerciser to test the message flow",
                                "steps": {
                                    "type": "ordered",
                                    "details": [                                      
                                    {
                                        "details": "Open <span class='resource'>ExampleFlow.msgflow</span> and click the Flow Exerciser icon <img src='http://ot4i.github.io/ot4i.tutorials//dist/images/icons/iib/startFlowExerciser.png' alt='' /> to start testing the flow."
                                        },
										{
                                            "details": "Click the Send Message icon <img src='http://ot4i.github.io/ot4i.tutorials/dist/images/icons/iib/sendMessage.png' alt='' />. One saved message is provided, named InputJSON, which can be used to invoke the HTTP Input node..."
                                        },																				
                                        {
                                            "details": "The input message <span class='resource'>Input1</span> contains this data:<br><code>{<br>&nbsp;&nbsp;&nbsp;&nbsp;\"message\": \"hello world\"<br>}</code><br><br>Select this input message and click Send and your message is sent to the HTTPInput node. You will receive an XML reply message structured like this:<br><code>&lt;?xml version=\"1.0\" encoding=\"UTF-8\"?&gt;&lt;Message&gt;HELLO WORLD&lt;Message&gt;<br></code><br>After you close the dialog, the path taken through the message flow will be highlighted."
											},
										{										
										  "details": "Now we have tested the message flow, we will optimize the server startup to match the content of the configured integration server. Before progressing to the next set of instructions, please STOP your integration server from the Toolkit. Click the Return Flow to Edit mode button, and then righ-click TEST_SERVER and select Stop. The next stages involve interacting with the integration server's work directory and ensuring the server is stopped will avoid any of the files being locked by another process."
										}									
                                        ]
                                    }
                            },
							{
                                "section": "<h4>Open a Command Console",
                                "steps": {
                                    "type": "ordered",
                                    "details": [  
										 {
										"details":"Open an IBM App Connect Enterprise command console and execute the following command, using the file system location of your Toolkit workspace in place of &lt;Your Toolkit Workspace Location&gt;<br><code>ibmint optimize server --work-directory &lt;Your Toolkit Workspace Location&gt;\\TEST_SERVER --verbose</code><br><br>The response should look like this:<br><br><code>BIP15243I: Analyzing server configuration.<br>BIP15257I: The component 'NodeJS' is required for YAML configuration setting 'RestAdminListener/port' with value '7600'.<br>BIP15244I: Analyzing application 'ExampleApplication'.<br>BIP15250I: Analyzing message flow 'ExampleFlow'.<br>BIP15251I: Analyzing message flow node 'HTTP Input'.<br>BIP15251I: Analyzing message flow node 'HTTP Reply'.<br>BIP15251I: Analyzing message flow node 'Compute'.<br>BIP15254I: The component 'Nodes/ESQL' is required for message flow node 'Compute' of type 'ComIbmCompute'.<br>BIP15255I: The component 'Nodes/ESQL' is required for deployed resource 'ExampleFlow_Compute.esql'.<br>BIP15237I: The components file '&lt;Your Toolkit Workspace Location&gt;\\TEST_SERVER\\server.components.yaml' was created. It may be further edited if required.<br>BIP8071I: Successful command completion.</code><br>"
										 }
                    					]
								}
							}
				]
				
                },
                "helpLinks": 
				{
                    "title": "Find out more",
                    "details": 
					[
                        {
						"title": "IBM Documentation link to ",
						"description": "Optimizing the startup time for an independent integration server",
                        "link": "https://www.ibm.com/docs/en/app-connect/12.0?topic=solutions-optimizing-startup-time-independent-integration-server",
						"type": "web"
						},
                        {
                            "title": "IBM Documentation link to ",
                            "description": "Testing your message flow by using the Flow exerciser",
                            "link": "https://www.ibm.com/docs/SSTTDS_12.0/com.ibm.etools.mft.doc/rt26110_.htm",
							"type": "web"
                        }
                    ]
                }
            }
        }
    }
}
